<a href="https://colab.research.google.com/github/faspy/monty_python/blob/master/03_00_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Series**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d={'a':10,'b':20,'c':30}

In [ ]:
# Calling a list specifying attributes
pd.Series(data = my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
# Calling a list
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
# Calling an array
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
# Calling an dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
# Setting labels as values
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [ ]:
# Setting functions (pandas is flexible to receive different types of objects)
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [ ]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Japan','Italy'])
ser2

USA        1
Germany    2
Japan      5
Italy      4
dtype: int64

In [ ]:
ser2['USA']

1

In [ ]:
ser3 = pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [ ]:
ser3[0]

'a'

In [ ]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      9.0
USA        2.0
USSR       NaN
dtype: float64

#**Dataframes**

###Creating a dataframe

In [ ]:
import numpy as np
from numpy.random import randn

import pandas as pd

# seed to get same random numbers
np.random.seed(101)

In [ ]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

###Selecting columns

In [ ]:
print(df['W'])
type(df['W'])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

pandas.core.series.Series

In [ ]:
# Be careful while selecting a column this way. The column name could be confused by a method name
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [ ]:
#Getting multiples columns
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

###Adding Columns

In [ ]:
#Adding a new column to your dataset
df['new'] = df['W']+df['Z']
df['new']

A    3.210676
B    1.257083
C   -2.607169
D    1.143752
E    0.874303
Name: new, dtype: float64

###Dropping Columns

In [ ]:
#Dropping a column in you dataset
print(df)
df.pop('new')
print(df)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#Adding and removing column through a different method
df['new'] = df['W']+df['Z']
print(df)

#method drop() works in indexes by default, that's why you need to set axis=1
#inplace reinforces changes in an specific way to avoid other changes in the dataset
df.drop(labels='new',axis=1,inplace=True)
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#Removing lines -> works in indexes, so it does not need parameters
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

*Axis reference considers the 2d matrix (tuple) -> (x,y). Try checking out* `df.shape`

*Thats why 1 is for columns and x for lines*

###Selecting values

In [ ]:
# Getting rows as Series -> labeled index selection
df.loc['A']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
# Getting rows as Series -> numerical basis selection
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
#Getting out values from dataset
print(df)
print(df.loc['B','Y'])

print(df)
df.iloc[1,2]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
-0.8480769834036315
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

-0.8480769834036315

###Selecting Subsets

In [ ]:
#Getting out a subset 
print(df)
print(df.loc[['B','C','D'],['X','Y']])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
          X         Y
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237

###Conditional Selecting

In [ ]:
import numpy as np
from numpy.random import randn

import pandas as pd

# seed to get same random numbers
np.random.seed(101)

df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [ ]:
booldf = df>0

df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [ ]:
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [ ]:
boolser = df['W']>0
result = df[boolser]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
my_columns = ['X','Y']
result[my_columns]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

###Multiple Conditional Selection

In [ ]:
#AND operator for dataframe
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#OR operator for dataframe
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

###Setting and Resetting Indexes

In [ ]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
newind = 'CA NY WY OR CO'.split()

In [ ]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [ ]:
df['States'] = newind

In [ ]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [ ]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

###Multindex dataframes

In [ ]:
import numpy.random as np
import pandas as pd

#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list (zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [ ]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [ ]:
df.loc['G1']

          A         B
1  0.414038 -0.480369
2  0.113911  0.658636
3 -1.649480 -0.015016

In [ ]:
df.loc['G1'].loc[1]

A    0.414038
B   -0.480369
Name: 1, dtype: float64

In [ ]:
df.index.names

FrozenList([None, None])

In [ ]:
df.index.names = ['Groups','Num']

In [ ]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [ ]:
df.loc['G2'].loc[2]['B']

0.15006230775218166

In [ ]:
#Cross section reference
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

#**Missing Data**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [ ]:
df = pd.DataFrame(d)

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

##Dropping null values

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
#Drop only the rows which contain 2 NaN values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

##Dropping lines with null values in a specific column

In [ ]:
df = df.dropna(subset=['B'])
df

     A    B  C
0  1.0  5.0  1

##Fulfiling null values

In [ ]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [ ]:
df['A'] = df['A'].fillna(value=df['A'].mean())
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [ ]:
df[df['A']==df['A'].min()]

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [ ]:
df['A'] = df['A'].fillna(value=df['A'].mean())
df['B'] = df['B'].fillna(value=df['B'].mean())
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

##Selecting null values

In [ ]:
x= df['A'].isnull()
df[x]

    A   B  C
2 NaN NaN  3

In [ ]:
y = df.isnull().any(axis=1)
df[y]

     A   B  C
1  2.0 NaN  2
2  NaN NaN  3

#**Group By**

In [21]:
import pandas as pd
import numpy as np

In [22]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [23]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [24]:
byComp = df.groupby('Company')
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [25]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [26]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [29]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [30]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [31]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [32]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [34]:
round(df.groupby('Company').describe().transpose(),1)

Company         FB   GOOG   MSFT
Sales count    2.0    2.0    2.0
      mean   296.5  160.0  232.0
      std     75.7   56.6  152.7
      min    243.0  120.0  124.0
      25%    269.8  140.0  178.0
      50%    296.5  160.0  232.0
      75%    323.2  180.0  286.0
      max    350.0  200.0  340.0